In [4]:
import numpy as np
import pandas as pd

In [5]:
dict1 = {
    'name' : ['chithra','shravani','srujana','shravs'],
    'age' : [12,21,34,56],
    'marks': ['hyderabad','nzb','kmr','psd']
}

In [6]:
df = pd.DataFrame(dict1)
# this will convert the data into excel sheet for faster indexing

df

       name  age      marks
0   chithra   12  hyderabad
1  shravani   21        nzb
2   srujana   34        kmr
3    shravs   56        psd

In [9]:
df.to_csv('friends.csv',index=False)
# to view it in excel sheet

In [ ]:
df.head(2)
# to only shoow 2 rows from beginning

       name  age      marks
0   chithra   12  hyderabad
1  shravani   21        nzb

In [ ]:
df.tail(2)
# to only 2 rows from end

      name  age marks
2  srujana   34   kmr
3   shravs   56   psd

In [14]:
df.describe()

             age
count   4.000000
mean   30.750000
std    19.102792
min    12.000000
25%    18.750000
50%    27.500000
75%    39.500000
max    56.000000

In [16]:
# till now we have converted our data into csv file
# but now let us try to read csv file using pandas
rests= pd.read_csv('practice.csv')
rests

  Restarant  age      place
0      res1   12  hyderabad
1      res2   21        nzb
2      res3   34        kmr
3      res4   56        psd

In [22]:
rests['age'][0] = 50

C:\Users\chith\AppData\Local\Temp\ipykernel_33580\3826473128.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  rests['age'][0] = 50

In [21]:
rests['age']

0    50
1    21
2    34
3    56
Name: age, dtype: int64

In [28]:
rests.to_csv('practice.csv')
# to make change in real csv file

In [26]:
rests.index=['first','second','third','fourth']
# to change indexes 0,1,2,3 to above mentioned list
rests

       Restarant  age      place
first       res1   50  hyderabad
second      res2   21        nzb
third       res3   34        kmr
fourth      res4   56        psd